In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost/sql_practice

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql 
show databases;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
9 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('practice',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('world',)]

In [5]:
%%sql 
use sql_practice;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
0 rows affected.

[]

In [6]:
%%sql 
show tables;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
1 rows affected.

[('test',)]

In [8]:
%%sql
CREATE TABLE employees(
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    hire_date DATE NOT NULL,
    salary DECIMAL(10,2)
);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
0 rows affected.

[]

In [11]:
%%sql
desc employees;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [12]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) values ( 1001, 'Viswaa', 'E', '2025-01-30', 50000.20);
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) values ( 1002, 'Gughashree', 'M', '2025-01-30', 60000.20);
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) values ( 1003, 'Kowsalya', 'S', '2025-01-30', 70000.20);
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) values ( 1004, 'Sathish', 'S', '2025-01-30', 80000.20);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql
select * from employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
14 rows affected.

[(1001, 'Viswaa', 'E', datetime.date(2025, 1, 30), Decimal('50000.20')),
 (1002, 'Gughashree', 'M', datetime.date(2025, 1, 30), Decimal('60000.20')),
 (1003, 'Kowsalya', 'S', datetime.date(2025, 1, 30), Decimal('70000.20')),
 (1004, 'Sathish', 'S', datetime.date(2025, 1, 30), Decimal('80000.20')),
 (1005, 'Priya', 'K', datetime.date(2025, 2, 1), Decimal('55000.50')),
 (1006, 'Arun', 'R', datetime.date(2025, 2, 2), Decimal('62000.75')),
 (1007, 'Meena', 'V', datetime.date(2025, 2, 3), Decimal('58000.00')),
 (1008, 'Karthik', 'P', datetime.date(2025, 2, 4), Decimal('72000.90')),
 (1009, 'Divya', 'S', datetime.date(2025, 2, 5), Decimal('64000.30')),
 (1010, 'Rajesh', 'B', datetime.date(2025, 2, 6), Decimal('75000.25')),
 (1011, 'Nisha', 'L', datetime.date(2025, 2, 7), Decimal('68000.60')),
 (1012, 'Vikram', 'D', datetime.date(2025, 2, 8), Decimal('83000.10')),
 (1013, 'Ananya', 'T', datetime.date(2025, 2, 9), Decimal('56000.80')),
 (1014, 'Suresh', 'G', datetime.date(2025, 2, 10), Decimal('71000.40'))]

In [16]:
%%sql
INSERT INTO employees (employee_id, first_name, last_name, hire_date, salary) VALUES
(1005, 'Priya', 'K', '2025-02-01', 55000.50),
(1006, 'Arun', 'R', '2025-02-02', 62000.75),
(1007, 'Meena', 'V', '2025-02-03', 58000.00),
(1008, 'Karthik', 'P', '2025-02-04', 72000.90),
(1009, 'Divya', 'S', '2025-02-05', 64000.30),
(1010, 'Rajesh', 'B', '2025-02-06', 75000.25),
(1011, 'Nisha', 'L', '2025-02-07', 68000.60),
(1012, 'Vikram', 'D', '2025-02-08', 83000.10),
(1013, 'Ananya', 'T', '2025-02-09', 56000.80),
(1014, 'Suresh', 'G', '2025-02-10', 71000.40);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
10 rows affected.

[]

In [20]:
%%sql
CREATE TABLE Highest_paid_employees AS 
SELECT 
    employee_id,
    first_name,
    last_name,
    salary
FROM employees
WHERE salary > 60000;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
10 rows affected.

[]

In [21]:
%%sql
SELECT * FROM Highest_paid_employees;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
10 rows affected.

[(1002, 'Gughashree', 'M', Decimal('60000.20')),
 (1003, 'Kowsalya', 'S', Decimal('70000.20')),
 (1004, 'Sathish', 'S', Decimal('80000.20')),
 (1006, 'Arun', 'R', Decimal('62000.75')),
 (1008, 'Karthik', 'P', Decimal('72000.90')),
 (1009, 'Divya', 'S', Decimal('64000.30')),
 (1010, 'Rajesh', 'B', Decimal('75000.25')),
 (1011, 'Nisha', 'L', Decimal('68000.60')),
 (1012, 'Vikram', 'D', Decimal('83000.10')),
 (1014, 'Suresh', 'G', Decimal('71000.40'))]

In [26]:
%%sql 
CREATE TABLE Highest_paid_employees_via_cte AS
with Highest_paid_employees_cte AS (
    SELECT employee_id, first_name, last_name, salary
    FROM employees
    WHERE salary > 80000
)
SELECT * FROM Highest_paid_employees_cte;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
2 rows affected.

[]

In [27]:
%%sql 
SELECT * FROM Highest_paid_employees_via_cte;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
2 rows affected.

[(1004, 'Sathish', 'S', Decimal('80000.20')),
 (1012, 'Vikram', 'D', Decimal('83000.10'))]

In [33]:
%%sql 
desc employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]

In [30]:
%%sql
alter table employees add email VARCHAR(100);

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
0 rows affected.

[]

In [32]:
%%sql
alter table employees drop email;

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
0 rows affected.

[]

In [34]:
%%sql
alter table employees rename to Employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
0 rows affected.

[]

In [35]:
%%sql
desc Employees

   mysql+mysqlconnector://root:***@localhost
 * mysql+mysqlconnector://root:***@localhost/sql_practice
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, '')]